SpenceKonde/megaTinyCore/megaavr/boards.txt
##############################################################
#      ATtiny3217/1617/1607/817/807/417 (Optiboot)
##############################################################

atxy7o.upload.workaround=
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.serialeventabr=
atxy7o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7o.menu.chip.3217.build.attiny=3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7o.menu.chip.1617.build.attiny=1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.board=AVR_ATtiny817
atxy7o.menu.chip.817.build.attiny=817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.board=AVR_ATtiny417
atxy7o.menu.chip.417.build.attiny=417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7o.menu.chip.1607.build.attiny=1607
atxy7o.menu.chip.1607.build.millistimer=A0
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.board=AVR_ATtiny807
atxy7o.menu.chip.807.build.attiny=807
atxy7o.menu.chip.807.build.millistimer=A0
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20internal=20 MHz Internal
atxy7o.menu.clock.16internal=16 MHz Internal
atxy7o.menu.clock.10internal=10 MHz Internal
atxy7o.menu.clock.8internal=8 MHz Internal
atxy7o.menu.clock.5internal=5 MHz Internal
atxy7o.menu.clock.4internal=4 MHz Internal
atxy7o.menu.clock.1internal=1 MHz Internal
atxy7o.menu.clock.20extclock=20 MHz External CLOCK
atxy7o.menu.clock.16extclock=16 MHz External CLOCK
atxy7o.menu.clock.12extclock=12 MHz External CLOCK
atxy7o.menu.clock.10extclock=10 MHz External CLOCK
atxy7o.menu.clock.8extclock=8 MHz External CLOCK
atxy7o.menu.clock.24extclock=24 MHz External CLOCK (overclocked)
atxy7o.menu.clock.28extclock=28 MHz External CLOCK (overclocked)
atxy7o.menu.clock.32extclock=32 MHz External CLOCK (overclocked)
atxy7o.menu.clock.20internal.build.speed=20
atxy7o.menu.clock.20internal.build.clocksource=0
atxy7o.menu.clock.16internal.build.speed=16
atxy7o.menu.clock.16internal.build.clocksource=0
atxy7o.menu.clock.10internal.build.speed=10
atxy7o.menu.clock.10internal.build.clocksource=0
atxy7o.menu.clock.8internal.build.speed=8
atxy7o.menu.clock.8internal.build.clocksource=0
atxy7o.menu.clock.5internal.build.speed=5
atxy7o.menu.clock.5internal.build.clocksource=0
atxy7o.menu.clock.4internal.build.speed=4
atxy7o.menu.clock.4internal.build.clocksource=0
atxy7o.menu.clock.1internal.build.speed=1
atxy7o.menu.clock.1internal.build.clocksource=0
atxy7o.menu.clock.20extclock.build.speed=20
atxy7o.menu.clock.20extclock.build.clocksource=2
atxy7o.menu.clock.16extclock.build.speed=16
atxy7o.menu.clock.16extclock.build.clocksource=2
atxy7o.menu.clock.12extclock.build.speed=12
atxy7o.menu.clock.12extclock.build.clocksource=2
atxy7o.menu.clock.10extclock.build.speed=10
atxy7o.menu.clock.10extclock.build.clocksource=2
atxy7o.menu.clock.8extclock.build.speed=8
atxy7o.menu.clock.8extclock.build.clocksource=2
atxy7o.menu.clock.24extclock.build.speed=24
atxy7o.menu.clock.24extclock.build.clocksource=2
atxy7o.menu.clock.28extclock.build.speed=28
atxy7o.menu.clock.28extclock.build.clocksource=2
atxy7o.menu.clock.32extclock.build.speed=32
atxy7o.menu.clock.32extclock.build.clocksource=2
atxy7o.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7o.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7o.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V (unofficial)
atxy7o.menu.bodvoltage.2v9=2.9V (unofficial)
atxy7o.menu.bodvoltage.3v3=3.3V (unofficial)
atxy7o.menu.bodvoltage.3v7=3.7V (unofficial)
atxy7o.menu.bodvoltage.4v0=4.0V (unofficial)
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy7o.menu.bodmode.disabled=Disabled/Disabled
atxy7o.menu.bodmode.enabled=Enabled/Enabled
atxy7o.menu.bodmode.ensampfast=Enabled/Sampled (1kHz)
atxy7o.menu.bodmode.ensampslow=Enabled/Sampled (125Hz)
atxy7o.menu.bodmode.sampledfast=Sampled/Sampled (1kHz)
atxy7o.menu.bodmode.sampledslow=Sampled/Sampled (125Hz)
atxy7o.menu.bodmode.sampdisfast=Sampled/Disabled (1kHz)
atxy7o.menu.bodmode.sampdisslow=Sampled/Disabled (125Hz)
atxy7o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy7o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy7o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy7o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

